CBWSTC/CBWSTC_WorkSpace/Projects/ExpenseReimbursementSystem2/XML/calculateReimbursementAmount.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Header/>
   <soapenv:Body>
      <exp:calculateReimbursementAmount xmlns:exp="http://exp.simple.ws">
         <!--anonymous type - enumeration: [seniormanager,manager]-->
         <exp:stafflevel>?</exp:stafflevel>
         <!--anonymous type-->
         <exp:actualmonthlymileage>?</exp:actualmonthlymileage>
      </exp:calculateReimbursementAmount>
   </soapenv:Body>
</soapenv:Envelope>